Autodesk.Revit.UI.ISiteLinkerUIServerProxy.ShowLinkDlg(Autodesk.Revit.DB.Document,System.Boolean,Autodesk.Revit.UI.SiteLinkerUIData)
The method that Revit will invoke to show link topography dialog.
document:
The associated document.
popSignin:
Popup the sign in dialog when user is not signed in.
data:
The site linker ui data.
Returns:
Indicates whether the site linker ui server is executed successfully.
Since:
2019

Autodesk.Revit.UI.ISiteLinkerUIServerProxy.GetDBServerId
Implement this method to return the id of the server which is associated with this UI server.
Remarks:
If there's no DB server associated with this UI server, an empty GUID value will be returned.
Returns:
The id of the associated DB server.
Since:
2019